app/controllers/games_controller.rb

SELECT "alphabets".* FROM "alphabets"
---
  def merdeaf
    @alphabets = Alphabet.all

SELECT "alphabets".* FROM "alphabets"
---
  def wordsearch
    @alphabets = Alphabet.all

SELECT "numbers".* FROM "numbers"
---
  def sudoku
    @numbers = Number.all