app/controllers/lessons_controller.rb

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def alphabets
    @lessons = Lesson.find(1)

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def numbers
    @lessons = Lesson.find(2)