app/controllers/merdeaf_scores_controller.rb

  def index
    @merdeaf_scores = MerdeafScore.order("score DESC").limit(15)

    @latest_scores = MerdeafScore.last
---
SELECT "merdeaf_scores".* FROM "merdeaf_scores" ORDER BY score DESC
SELECT  "merdeaf_scores".* FROM "merdeaf_scores" ORDER BY "merdeaf_scores"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @merdeaf_score = MerdeafScore.new(merdeaf_score_params)

    respond_to do |format|
      if @merdeaf_score.save
---
INSERT INTO "merdeaf_scores" ("name", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "baa"], ["score", 1092], ["created_at", "2019-09-17 03:17:12.460757"], ["updated_at", "2019-09-17 03:17:12.460757"]]

    def set_merdeaf_score
      @merdeaf_score = MerdeafScore.find(params[:id])
---
SELECT  "merdeaf_scores".* FROM "merdeaf_scores" WHERE "merdeaf_scores"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]