app/controllers/words_controller.rb

  def index
    @words = Word.all.order('name ASC')
---
SELECT "words".* FROM "words" ORDER BY name ASC

  def show
    @word = Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]

    def set_word
      @word = Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]